[
    {
        "client_msg_id": "a1cc72d5-10e9-4a22-b23d-b8f7c628c519",
        "type": "message",
        "text": "&gt; There’s also a good chance you end up at the Spearmint Rhino to check out some of the hottest strippers in the world. Just remember two things: 1) you’re going to spend a lot of money and 99% of the time they’re going to bleed you dry on lap dances and ATM fees 2) they’ll always pick you up in a free limo to get you over there.",
        "user": "U15J5H60P",
        "ts": "1531612900.000080"
    },
    {
        "client_msg_id": "ed5e3d2d-de80-4ce5-8ae4-fb698731982f",
        "type": "message",
        "text": "- <https:\/\/brobible.com\/life\/article\/best-bachelor-party-locations\/>",
        "user": "U15J5H60P",
        "ts": "1531612909.000021",
        "attachments": [
            {
                "service_name": "BroBible",
                "service_url": "http:\/\/brobible.com",
                "title": "The 12 Best Locations to Have a Bachelor Party",
                "title_link": "https:\/\/brobible.com\/life\/article\/best-bachelor-party-locations\/",
                "author_name": "Jerry Thompson",
                "author_link": "https:\/\/brobible.com\/author\/jerryuproxx\/",
                "thumb_url": "https:\/\/brobible.files.wordpress.com\/2017\/03\/gronk-south-beach-party-pics-videos.jpg?quality=90&w=650&fit=200%2C150&strip",
                "thumb_width": 200,
                "thumb_height": 134,
                "text": "Getty ImageOnce you get out of college, the trips you learn to look forward to the most are bachelor parties. As one of my friends pointed out on a recent bachelor party, &ldquo;bachelor parties are more for the friends of the bachelor than the bachelor themselves.&rdquo; While it may be the last weekend of freedom for the bachelor, his friends get to use the excuse of his bachelor party to travel to a fun destination, get excessively drunk, creep on girls, and enjoy things like golfing, paint-balling, or shooting guns. You may be concerned with other bachelor party ideas, but let me reiterate the destination part. You can&rsquo;t have a true bachelor party in your home town and it can&rsquo;t be for only one night. You have to do things right. This is supposed to be your last hurrah, not a night away with the guys. You should still be able to get those when you get married.\nThings that need to be included in a great bachelor party include alcohol, women, good food, sporting activities (both watch and play), and gambling. All these locations meet most if not all of those required objectives. Given that I&rsquo;ve been to a few bachelor parties in my day and don&rsquo;t plan on having my own very soon, here&rsquo;s my list of the 12 best locations to have a bachelor party. (Hopefully my friends can work off this list themselves, so that it results in an epic weekend for yours truly.) The only caveat to this list is that every place is within a six hour flight of somewhere in America. Therefore Asia, South America, and 99% of Europe don&rsquo;t qualify.\n12. Atlantic City\nWe all know Atlantic City is the homeless man&rsquo;s Las Vegas. It&rsquo;s pretty convenient to get to from the East Coast (fly into Philadelphia or drive from wherever). The biggest selling point is obviously the amount of casinos concentrated into one area. There are a few nice golf courses and the summer time provides good weather for that. There&rsquo;s also the pool party at the Harrah&rsquo;s that&rsquo;s become a big deal and Revel plans on going big with its pool and beach scene next summer. (That&rsquo;s assuming Revel works its way through bankruptcy.) You can grab a good meal at decent restaurants including Marc Forgione&rsquo;s American Cut steakhouse at Revel, Bobby Flay Steak at the Borgata. The Borgata and Revel also have pretty nice clubs to do the whole bottle service thing and meet some girls willing to take their clothes off after you treat them to some free alcohol. The major bummer with AC is that hotel room pricing is pretty absurd during the summer, especially on Saturdays.\n11. Cancun\nOf all the possible destinations in Mexico, Cancun offers the best bachelor party experience. Cabo San Lucas is a little too couple friendly for what a bachelor party needs. The good thing about Cancun is that it&rsquo;s a pretty good destination for most of the year because of its good weather. Warm weather obviously breeds good golfing, good fishing, good beach time, and plenty of chicks in bikinis. But it&rsquo;s not the perfect location. You always got to stick to bottled water or there&rsquo;s a chance you&rsquo;ll be shitting your brains out for 24 hours. The food leaves something to be desired. On the slight chance you get arrested, which isn&rsquo;t a novel concept for a bachelor party, a Mexican prison is one of the darkest places you can be. It&rsquo;s also more spring break and less for the working adults, so it doesn&rsquo;t quite crack the top ten.\n10. New York\nMaybe it&rsquo;s because I&rsquo;m from New York and lived here every year of my life except the four during college, but it&rsquo;s hard for me to have the best city in the world rated higher as a bachelor party destination. It certainly does have its positives, which are most of the reasons I live here. For starters there&rsquo;s every type of bar imaginable and you can drink til 4 a.m. You can relive your younger days at Brother Jimmys, drink some good brews at the Standard Beer Garden, or hit a club like SL or 1Oak. The restaurants offer any cuisine a bachelor party can want whether it be pizza (Lombardis and Co for two or Di Fara if you&rsquo;re willing to travel to Brooklyn), burgers (PJ Clarkes or Minetta Tavern), barbecue (Wildwood or Blue Smoke), or steak (Strip House or Benjamins). But my fine city has its downfalls for bachelor parties. It&rsquo;s expensive, specifically with hotel rooms. You can&rsquo;t do anything in New York between September and December because hotel prices will be through the roof. It also isn&rsquo;t the best for strip clubs (oh yes, we know those matter too). The fact that the girls need to keep their bottoms on in Manhattan because alcohol is served is quite the bummer.\n9. Costa Rica\nThe next two locations might be off the beaten path, but they could deliver exactly what you&rsquo;re looking for in a bachelor party. If you&rsquo;re looking to do something during the winter months, then Costa Rica might be the place for you. It probably has a leg up on Cancun in terms of golfing and fishing. You can take your sports a step further and do some zip-lining. You can lock in a great five bedroom house in Los Suenos to get your crew four nights on the cheap. And the coup de gr&acirc;ce is the women, but you gotta pay for them.&nbsp; You can bed a real good looking girl for about a hundred dollars at a bar in the Jaco area, which means you can have your own threesome for less than you&rsquo;d pay for bottle service and less effort. It&rsquo;s just personally not my thing or else this Central American country would be higher up on my list.\n8. Iceland\nOur second location that may surprise you is a country that isn&rsquo;t known for its weather. There are just so many redeeming things about Iceland that make it an option for a bachelor party. We&rsquo;ll start with the women. Iceland is up there with any country I&rsquo;ve been to in terms of the quality of their chicks. You might think you&rsquo;re only getting blondes there, but you get plenty of good looking brunettes and even a few red heads as well. (Although a random thing with Iceland is there a lot of single mothers, so try not to further that situation.) The locals are very welcoming, which is always positive with a big group of guys. The food is surprisingly good although I suggest staying away from the local delicacy of petrified shark. The Blue Lagoon hot baths are a pretty awesome, once in a lifetime experience. Teeing off at the golf course at midnight is also something you can&rsquo;t do in many places, but is available to you here. And finally it&rsquo;s a pretty easy place to get drunk with lots of bars in downtown Reykjavik.\n7. Nashville\nI was in Nashville over President&rsquo;s Weekend for a bachelor party and I was surprisingly impressed. There&rsquo;s a reason it has the nickname of NashVegas. It&rsquo;s a destination for travelers in the South and Midwest because it&rsquo;s easy to get to and has a lot to offer. The good thing about a place like that is the people you meet are pretty carefree and the visiting girls are more likely to sow their wild oats. The food scene isn&rsquo;t as good as Memphis, but you can get some decent barbecue at Jack&rsquo;s, a one of a kind meat and three (a local specialty which includes a meat of the day like juicy roast beef and three southern style sides), or the Nashville specialty of hot chicken. There are two main areas to get your drink on. There&rsquo;s the well-known strip of bars on Broadway (Tootsie&rsquo;s, the Stage, and Honkey Tonk are three necessary stops) and a couple streets close by in the downtown area. You can also travel out to the Midtown area near Vanderbilt and find plenty of places there. Grab yourself a bushwacker at the Broadway Brewhouse.\nI highly suggest checking out the Nashville Pedal Tavern, which is a unique and fun way to do a bar crawl and gather random chicks to hang out with. If you like shooting guns, you can do that too. For your sports fix, yo…",
                "fallback": "BroBible Link: The 12 Best Locations to Have a Bachelor&nbsp;Party",
                "from_url": "https:\/\/brobible.com\/life\/article\/best-bachelor-party-locations\/",
                "service_icon": "https:\/\/s2.wp.com\/wp-content\/themes\/vip\/brobible\/images\/apple-touch-icon-72x72.png",
                "id": 1,
                "original_url": "https:\/\/brobible.com\/life\/article\/best-bachelor-party-locations\/"
            }
        ]
    },
    {
        "client_msg_id": "14722404-3BEB-461C-A2F4-4DC0C7BF8AF7",
        "type": "message",
        "text": "Hemorrhaging ",
        "user": "U15HSHSS2",
        "ts": "1531613056.000018"
    },
    {
        "client_msg_id": "9ABC776C-BB8E-4909-9963-68391A7AD5A2",
        "type": "message",
        "text": "Not leaving till this shirt is brown",
        "user": "U15HSHSS2",
        "ts": "1531613072.000015",
        "reactions": [
            {
                "name": "mask",
                "users": [
                    "U15HZ01QX"
                ],
                "count": 1
            }
        ]
    },
    {
        "client_msg_id": "9968729f-208d-4a59-aecb-557f2ffb31ae",
        "type": "message",
        "text": ":joy:",
        "user": "U15J5H60P",
        "ts": "1531613082.000064"
    },
    {
        "client_msg_id": "3BA3767A-B20A-441D-9E62-78976CEEBBA6",
        "type": "message",
        "text": "Lolol",
        "user": "U15HY5TG8",
        "ts": "1531614521.000021"
    }
]