[
    {
        "type": "message",
        "text": "I need some advice",
        "user": "U15HZ01QX",
        "ts": "1477147805.000002"
    },
    {
        "type": "message",
        "text": "Alright",
        "user": "U15HY5TG8",
        "ts": "1477147976.000003"
    },
    {
        "type": "message",
        "text": "I'm thinking about canceling my Brady interviews for Thursday and Friday. It's for a rotational program but it's in firmware engineering and I realistically don't know anything on the subject. I feel like the interview will be a disaster and idk if I wanna sit through all of that. Anyone have any thoughts? Anyone do a firmware interview? Is it too late to cancel? I don't wanna burn that bridge but i might burn it just by going there without studying C++ and stuff. <!channel> ",
        "user": "U15HZ01QX",
        "ts": "1477148044.000004"
    },
    {
        "type": "message",
        "text": "shit thats tough haha. do you see yourself going back there in the future though?",
        "user": "U15HY5TG8",
        "ts": "1477148571.000005"
    },
    {
        "type": "message",
        "text": "Possibly",
        "user": "U15HZ01QX",
        "ts": "1477148590.000006"
    },
    {
        "type": "message",
        "text": "If it were me, i would take the full honesty route. id contact them and just say, to be honest, i have no idea about firmware engineering and I was wondering if you would still like to interview me on thursday or friday or if i would be better off waiting for a position within the company that i have expertise in",
        "user": "U15HY5TG8",
        "ts": "1477148685.000007"
    },
    {
        "type": "message",
        "text": "I'm thinking about just saying I accepted something already",
        "user": "U15HZ01QX",
        "ts": "1477148772.000008"
    },
    {
        "type": "message",
        "text": "that could work too. its just the rotational thing anyways though too",
        "user": "U15HY5TG8",
        "ts": "1477148808.000009"
    },
    {
        "type": "message",
        "text": "Well even if Rockwell and joy say no, I'd still do US bank over Brady ",
        "user": "U15HZ01QX",
        "ts": "1477148845.000010"
    },
    {
        "type": "message",
        "text": "yea exactly. i think youll be alright canceling with good reason. especially if you know nothing and wont be happy doing it",
        "user": "U15HY5TG8",
        "ts": "1477148876.000011"
    },
    {
        "type": "message",
        "text": "Any one else?",
        "user": "U15HZ01QX",
        "ts": "1477148974.000012"
    },
    {
        "type": "message",
        "text": "I have no advice, id just limit myself to the ones I want",
        "user": "U15HRTAHL",
        "ts": "1477150826.000013"
    },
    {
        "type": "message",
        "text": "So you wouldn't bother",
        "user": "U15HZ01QX",
        "ts": "1477150865.000014"
    },
    {
        "type": "message",
        "text": "Nope",
        "user": "U15HRTAHL",
        "ts": "1477150962.000015"
    },
    {
        "type": "message",
        "text": "I don't really have a huge issue with the job I just don't want to have to spend hours reviewing 351 and 337 homework just to qualify I guess",
        "user": "U15HZ01QX",
        "ts": "1477151142.000016"
    }
]